# World's Tallest Buildings

In [1]:
import pandas as pd

In [2]:
tallest_buildings = pd.read_csv("./data/tallestBldgs.csv")
tallest_buildings.head()

                         bldg_name          city  height_m  stories      yr
0                      Burj Dubai          Dubai  818.0832      162  2009.0
1                      Taipei 101         Taipei  509.3208      101  2004.0
2  Shanghai World Financial Center      Shanghai  491.9472      101  2008.0
3                Petronas Tower 1   Kuala Lumpur  452.0184       88  1998.0
4                Petronas Tower 2   Kuala Lumpur  452.0184       88  1998.0

The file tallestBldgs.csv contains data for the 200 tallest buildings in the world. There are five variables:
* bldg_name: building name
* city: city in which the building is located
* height_m: height in meters
* stories: the number of stories
* yr: the year in which the building was structurally completed.

Number of buildings higher than 400 m.

In [3]:
n400 = (tallest_buildings.height_m > 400).sum()
n400

11

In [4]:
b400 = tallest_buildings.bldg_name[tallest_buildings.height_m > 400]
b400

0                            Burj Dubai
1                            Taipei 101
2        Shanghai World Financial Center
3                      Petronas Tower 1
4                      Petronas Tower 2
5     Nanjing Greenland Financial Center
6                           Sears Tower
7                  Guangzhou West Tower
8                         Jin Mao Tower
9       Two International Finance Centre
10     Trump International Hotel & Tower
Name: bldg_name, dtype: object

In [5]:
b400_old = tallest_buildings.bldg_name[(tallest_buildings.height_m > 400) & (tallest_buildings.yr < 2000)]
b400_old

3    Petronas Tower 1
4    Petronas Tower 2
6         Sears Tower
8       Jin Mao Tower
Name: bldg_name, dtype: object

In [6]:
b250_old = tallest_buildings.bldg_name[(tallest_buildings.height_m > 250) & (tallest_buildings.yr < 1950)]
b250_old

13              Empire State Building
31                  Chrysler Building
56     American International Building
65                 The Trump Building
113                       GE Building
Name: bldg_name, dtype: object

In [7]:
b250_old_city = tallest_buildings.city[(tallest_buildings.height_m > 250) & (tallest_buildings.yr < 1950)]
b250_old_city

13     New York City
31     New York City
56     New York City
65     New York City
113    New York City
Name: city, dtype: object